import { Link } from "react-router-dom";
import guideimg01 from "../../../componants/img/guideimg/Article01.jpg"



const TradingGuideArticle = () => {
    const sectionStyle = {
        background: "#fff",
        padding: "20px",
        borderRadius: "12px",
        marginBottom: "20px",
        boxShadow: "0 2px 6px rgba(0,0,0,0.08)",
        lineHeight: "1.6",
    };

    return (
        <div style={{ background: "#f6f7fb", minHeight: "100vh", paddingBottom: "50px" }}>

            {/* Back */}
            <div style={{
                padding: "20px",
                background: "#0c2a5b"
            }}>
                <Link
                    to="/buyer/tradingguide"
                    style={{
                        textDecoration: "none",
                        color: "#fff",
                        fontWeight: "bold",
                        fontSize: "16px"
                    }}
                >
                    Back
                </Link>
            </div>



            {/* Header - Blue Card */}

            <div style={{
                textAlign: "center",
                background: "#0c2a5b",
                padding: "40px 20px",
                borderRadius: "0 0 0px 0px",
                color: "white",
                marginBottom: "40px"

            }}>
                <h2 style={{ marginBottom: "10px", fontSize: "30px", fontWeight: "bold" }}>เซ็นทรัลพัฒนา เรซซิเด้นซ์ รุกแนวราบในกรุงเทพฯ มูลค่ากว่า 2.5 หมื่นล้าน</h2>
                <p style={{ fontSize: "16px", opacity: 0.9 }}>
                    20 พฤศจิกายน 2568 • DDproperty Editorial Team
                </p>

                <img
                    src={guideimg01}
                    alt="วางแผนการเงินอย่างชาญฉลาด"
                    style={{
                        width: "100%",
                        maxWidth: "600px",
                        borderRadius: "12px",
                        display: "block",
                        margin: "20px auto",
                        cursor: "pointer",
                    }}
                />



            </div>

            {/* Content */}
            <div style={{ width: "88%", margin: "auto" }}>
                {/* 1 */}
                <div style={sectionStyle}>
                    <p>[PR News] 11 ปี เซ็นทรัลพัฒนา เรซซิเด้นซ์ 51 โครงการ 65,700 ล้านบาท ประกาศรุกตลาดแนวราบในกรุงเทพฯ มูลค่ารวมกว่า 25,340 ล้านบาท ครบทุกเซ็กเมนต์ ด้วย 4 แบรนด์ "นิยาม-นิรดา-นินญา-นิรติ" ตอกย้ำคุณภาพทุกมิติ สะท้อนมาตรฐาน "บ้านเซ็นทรัล</p>
                    <br />
                    <p>ร.อ.กรี เดชชัย กรรมการผู้จัดการใหญ่ ธุรกิจที่อยู่อาศัย บริษัท เซ็นทรัลพัฒนา จำกัด (มหาชน) เปิดเผยว่า เซ็นทรัลพัฒนา เรซซิเด้นซ์ ดำเนินธุรกิจพัฒนาโครงการที่อยู่อาศัยมากว่า 10 ปี โดยเริ่มจากคอนโดมิเนียม ภายใต้แบรนด์ Escent ใน 3 ทำเลแรก ได้แก่ เชียงใหม่, ขอนแก่น และระยอง ซึ่งได้รับการตอบรับเป็นอย่างดี สามารถปิดการขายได้ในระยะเวลาอันรวดเร็ว</p>
                    <br />
                    <p>จากนั้นได้ขยายการพัฒนาทั้งโครงการบ้านและคอนโดไปยังหัวเมืองต่าง ๆ กว่า 20 จังหวัดทั่วประเทศ พร้อมต่อยอดสู่การพัฒนา "บ้านเซ็นทรัล" โซนกรุงเทพฯ อย่างแข็งแกร่ง</p>
                    <br />
                    <p>เราไม่ได้มองตัวเองเป็นแค่ผู้พัฒนาอสังหาฯ แต่เป็น Lifestyle Creator ที่สร้างวิถีชีวิตและรูปแบบการอยู่อาศัยแบบใหม่ ผ่าน 3 กลยุทธ์หลัก ได้แก่</p>
                    <br />
                    <p>1. Location-Led Strategy การเลือกทำเลศักยภาพให้กลายเป็นพื้นที่อยู่อาศัยคุณภาพ</p>
                    <br />
                    <p>2. Brand Portfolio Strategy การสร้างเอกลักษณ์ของแต่ละแบรนด์อย่างชัดเจนเพื่อตอบโจทย์แต่ละกลุ่มเป้าหมาย</p>
                    <br />
                    <p>3. Customer-Centric Experience การสร้างประสบการณ์ก่อนและหลังการขาย ผ่านบริการและนวัตกรรมต่าง ๆ</p>
                    <br />
                    <p>3. Customer-Centric Experience การสร้างประสบการณ์ก่อนและหลังการขาย ผ่านบริการและนวัตกรรมต่าง ๆ</p>
                    รวมทั้งสิทธิพิเศษที่ครอบคลุมไลฟ์สไตล์ลูกค้าไม่ว่าจะเป็น Eat-Play-Stay-Shop เพื่อให้ "บ้านเซ็นทรัล" เป็นตัวเลือกอันดับต้น ๆ ในใจลูกค้า
                </div>


                {/* 2 */}
                <div style={sectionStyle}>
                    <h3>1. Structure & System</h3>
                    <p>ระบบโครงสร้างที่แข็งแรงและออกแบบเพื่อการอยู่อาศัยระยะยาว เน้นความใส่ใจในทุกรายละเอียดด้านงานก่อสร้าง การวางระบบโครงสร้างพื้นฐาน ไปจนถึงพื้นที่การใช้งาน อาทิ</p>
                    <ul style={{ listStyleType: 'disc', paddingLeft: '20px' }}>
                        <li>1. Seismic Test เสาทุกต้นผ่านการทดสอบความสมบูรณ์ตามมาตรฐานของโครงการ</li>
                        <li>2. Conventional System การใช้ระบบก่ออิฐด้วยอิฐมวลเบา ที่มีความแข็งแรง ทนทานสูง และยืดหยุ่นในการปรับเปลี่ยนพื้นที่ในอนาคต</li>
                        <li>3. Slab on Beam พื้นจอดรถถูกออกแบบวางบนคานป้องกันการทรุดตัว</li>
                        <li>4. Sanitary System การเดินท่อประปาเหนือฝ้าเพื่อง่ายต่อการซ่อมบำรุง</li>
                        <li>5. Flood Protection ระบบป้องกันน้ำท่วมแบบครบวงจร</li>
                    </ul>
                </div>

                {/* 3 */}
                <div style={sectionStyle}>
                    <h3>2. Privacy & Security</h3>
                    <p>ระบบความปลอดภัยถึง 7 ระดับเพื่อความอุ่นใจในการอยู่อาศัย ได้แก่</p>
                    <ul style={{ listStyleType: 'disc', paddingLeft: '20px' }}>
                        <li>1. Double Gate แยกโซน Resident และ Visito</li>
                        <li>2. License Plate Recognition Access Control ระบบตรวจจับป้ายทะเบียนอัตโนมัติ</li>
                        <li>3. VMS (Visitor Management System) ระบบบันทึกข้อมูล สำหรับ Visitors ที่มาติดต่อ รวดเร็ว และแม่นยำ</li>
                        <li>4. SECURITY 24 ชั่วโมง</li>
                        <li>5. CCTV ติดตั้งกล้องวงจรปิดครอบคลุมทุกพื้นที่</li>
                        <li>6. รั้วรอบโครงการสูง 3 เมตร</li>
                        <li>7. Magnetic Sensor & Shock Sensor ที่ประตู-หน้าต่าง ตรวจสอบการเปิด-ปิด และตรวจจับแรงสั่นสะเทือน ของบานประตูและหน้าต่าง</li>
                    </ul>
                </div>

                {/* 4 */}
                <div style={sectionStyle}>
                    <h3>3. Privilege & After Sales Service</h3>
                    <p>บริการและประสบการณ์หลังการขายที่สร้างความผูกพันระยะยาวกับลูกค้า ลูกบ้านจะได้รับสิทธิพิเศษในฐานะ Central Citizens โดยรับสิทธิพิเศษจากเครือเซ็นทรัลเพื่อเติมเต็มคุณภาพชีวิตในทุกมิติ อาทิ บริการช่องจอดรถพิเศษเฉพาะลูกบ้านในศูนย์การค้าเซ็นทรัล, ส่วนลดและสิทธิพิเศษ จากแบรนด์ในเครือเซ็นทรัลกรุ๊ป เช่น Tops, Robinson, Powerbuy, Centara Hotel</p>
                    <br />
                    <p>นอกจากนี้ ในด้านบริการหลังการขาย เรายังมี ทีมบริหารนิติบุคคลมืออาชีพจากเซ็นทรัลพัฒนา เรซซิเด้นซ์ คอยดูแลบริการหลังการขายอย่างครบวงจร และอำนวยความสะดวกลูกค้าผ่านแอปพลิเคชั่น และมีบริการ Mr.Service สำหรับตรวจสอบคุณภาพบ้านและคอนโดทั้งภายในและภายนอกรวมถึงตรวจระบบน้ำ ไฟ และประปา</p>
                    <br />
                    <p>ทั้งนี้ สิ่งที่ทำให้บ้านเซ็นทรัลแตกต่าง นอกเหนือจากกลยุทธ์ที่กล่าวไปข้างต้น คือ คุณภาพงานก่อสร้างและรายละเอียดในการพัฒนาโครงการที่ผมและทีมงานใส่ใจในทุกขั้นตอน เพราะในฐานะวิศวกร ผมเชื่อว่าบ้านที่ดีต้องอยู่ได้ดี มีคุณภาพและอยู่ได้จริงในระยะยาว และนั่นคือหัวใจของการพัฒนาโครงการทุกหลังของเรา</p>
                </div>
            </div>
        </div>
    );
};

export default TradingGuideArticle;
